xfire-aegis/src/test/org/codehaus/xfire/message/wrapped/EchoData.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <echoData xmlns="http://services.xfire.codehaus.org">
    <bean>
      <data></data>
      <moreData></moreData>
    </bean>
  </echoData>
 </env:Body>
</env:Envelope>
